---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SchedulableField Methods
SchedulableField Class See Also Send Feedback
---

The SchedulableField type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
|  | GetCustomFieldData | Gets the data associated with this custom field. If this field isn't a CustomField will return nullNothingnullptra null reference (Nothing in Visual Basic). |
|  | GetHashCode | Gets the integer value of the SchedulableField as hash code  (Overrides Object..::..GetHashCode()()()().) |
|  | GetName | Gets the name of the field. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

SchedulableField Class

Autodesk.Revit.DB Namespace